Обработки/Reports/_ОтчетОФинансовыхРезультатахВРазрезеАналитикиЕПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОФинансовыхРезультатахВРазрезеАналитикиЕПС</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСворачиватьДоходыРасходыОтРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСворачиватьДоходыРасходыОтПереоценки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОФинансовыхРезультатахВРазрезеАналитикиЕПС/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	РаботаСОтчетами.ЗаполнитьВариантОтчета(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	Элементы.Результат.ИспользуемоеИмяФайла = "ОФР в разрезе аналитики" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Отчет.Период.ДатаОкончания));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Результат.ИспользуемоеИмяФайла = "ОФР в разрезе аналитики" + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Отчет.Период.ДатаОкончания));
	
	Если Не РаботаСОтчетамиКлиентСервер.ПроверитьНастройкиПодписантаОтчета(Отчет, Подписант, Отчет.Организация)
		ИЛИ Не ЗначениеЗаполнено(Подписант) 	
	Тогда
		РаботаСОтчетамиКлиентСервер.ЗаполнитьПодписанта(ЭтаФорма, Отчет.Организация); 		
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ИзменитьЗаголовокКнопкиПанельНастроек(
		Элементы.ПанельНастроек, Элементы.ГруппаПанельНастроек.Видимость);
		
	ЭтаФорма.Элементы.КомпоновщикНастроекНастройкиОтборВидСравнения.СписокВыбора.Добавить(ВидСравненияКомпоновкиДанных.ВСписке);
		
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	РаботаСОтчетамиКлиент.ПодписантОтчетаОбработкаВыбора(ЭтаФорма, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)

	РаботаСОтчетамиКлиент.ПодписантОтчетаПриИзменении(ЭтаФорма);

КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", ЭтаФорма.НастройкиОтчета.Подписант);
	ЭтаФорма.Подписант = ЭтаФорма.НастройкиОтчета.Подписант.КонтактноеЛицо;
	
	СкомпоноватьРезультат();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если ТипЗнч(ЭтаФорма.НастройкиОтчета) = Тип("Структура") 
		И ЭтаФорма.НастройкиОтчета.Свойство("ВариантОтчета") 
		И ТипЗнч(ЭтаФорма.НастройкиОтчета.ВариантОтчета) = Тип("УникальныйИдентификатор") Тогда
	
		ВариантОтчета = Справочники.ВариантыОтчетов.ПолучитьСсылку(ЭтаФорма.НастройкиОтчета.ВариантОтчета);
		Настройки = ВариантОтчета.Настройки.Получить();
		
		Отчет.КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(Настройки);
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.КомпоновщикНастроек.ПолучитьНастройки());
		
	КонецЕсли;
	
	Если ТипЗнч(Настройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных") Тогда
		Настройки.ДополнительныеСвойства.Свойство("НеСворачиватьДоходыРасходыОтРеализации", ЭтаФорма.Отчет.НеСворачиватьДоходыРасходыОтРеализации);
		Настройки.ДополнительныеСвойства.Свойство("НеСворачиватьДоходыРасходыОтПереоценки", ЭтаФорма.Отчет.НеСворачиватьДоходыРасходыОтПереоценки);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("НеСворачиватьДоходыРасходыОтРеализации", ЭтаФорма.Отчет.НеСворачиватьДоходыРасходыОтРеализации);
	Настройки.ДополнительныеСвойства.Вставить("НеСворачиватьДоходыРасходыОтПереоценки", ЭтаФорма.Отчет.НеСворачиватьДоходыРасходыОтПереоценки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Элементы.ГруппаПанельНастроек.Видимость = Не Элементы.ГруппаПанельНастроек.Видимость;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ИзменитьЗаголовокКнопкиПанельНастроек(
		Элементы.ПанельНастроек, Элементы.ГруппаПанельНастроек.Видимость);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период", Отказ); 	
	КонецЕсли;
	
КонецПроцедуры
